neuromorphic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>/Neuromorphic Introduction/</title>
<meta name="author" content="Jackson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title"><i>Neuromorphic Introduction</i></h1>
<p>
<i>This article will hopefully be a very brief and informal introduction to the world of neuromorphic computing. As I learn more about the topic I hope to continue updating this article with my findings.</i>
</p>
<div id="outline-container-orgff0dc4c" class="outline-2">
<h2 id="orgff0dc4c"><span class="underline">Introduction</span></h2>
<div class="outline-text-2" id="text-orgff0dc4c">
<p>
We&rsquo;ve all probably heard that Moore&rsquo;s law is dead, or something to that effect. This matters for us because our code no longer gets faster year over year just due to CPUs getting faster. There are two sides of a solution to this problem that have begun playing out recently. Option one is to create more CPUs cores on the same physical package, allowing programmers to take advantage of parallelism to solve their tasks faster. Option two is to explore alternative approaches to computation.
</p>

<p>
Neuromorphic computing is a proposed solution to the problem, and it sits under the category of option two. At a very high level neuromorphic has two major components, neurons and synapses. These two components are analogous to the neurons and synapses in the human body. Problems are solved by essentially recreating the structures formed in nature that allow huamns (and other animals) to process information and make decisions.
</p>

<blockquote>
<p>
Before you get your hopes up (or get extremely bored), no this is not a pathway towards artificial intelligence. While we are simulating how the brain works, the applications of neuromorphic computing are more tailored to control tasks and classification. However, more and more general purpose applications have found their way into neuromorphic computing, which is always exciting.
</p>
</blockquote>

<p>
Before we move on I should also note I am coming at the from the perspective of a programmer and computer scientist, not a hardware designer. Neuromorphic computing has vast applications in the hardware field which we will touch on, just know that I am not focused on those application at the moment.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 11/27/24</p>
<p class="author">Author: Jackson</p>
</div>
</body>
</html>
